testes/loadtest/spiketest/spike-test.yml
config:
  target: "http://localhost:8080" # NodeJS
  # target: "http://localhost:8000" # DRF
  # target: "http://localhost:5071/api" # .NET

  phases:
    - duration: 10
      arrivalRate: 100
      rampTo: 300
      name: Warm up the API
    - duration: 10
      arrivalRate: 300
      rampTo: 600
      name: Ramp up to peak load
    - duration: 10
      arrivalRate: 600
      name: Sustained peak load
    
scenarios:
  - name: SpikeTest
    flow:
      - post:
          url: "/componentes/"
          # url: "/Componente"
          json:
            nome: "nome novo componente"
            descricao: "descricao novo componente"
            referencia: "referencia novo componente"
            quantidade: 50
          capture:
            - json: '$.id'
              as: 'componentId'  # Captura o ID do componente criado
          # save:
          #   - component_id: '$.id'  # Salvar o ID do componente criado

      - put:
          url: "/componentes/{{ componentId }}/"
          # url: "/Componente/{{ componentId }}"
          json:
            # id: '{{ componentId }}'
            nome: "nome atualizado"
            descricao: "descricao atualizada"
            referencia: "referencia atualizada"
            quantidade: 100

      - get:
          url: "/componentes/"
          # url: "/Componente"

      - delete:
          url: "/componentes/{{ componentId }}/"
          # url: "/Componente/{{ componentId }}"